{
    "linkbase": "https://2018.postgresopen.org/",
    "mediabase": "https://2018.postgresopen.org/",
    "pgusbase": "https://postgresql.us/",

    "blogposts": [
    {
    "title": "PostgresOpen Early Bird Registration now Open",
    "sponsorname": "PostgresOpen",
    "posttime": "2018-06-08",
      "content":"<p>We are getting into swing with all things PostgresOpen SV 2018, the U.S. PostgreSQL Community Conference, running September 5-7 2018 in lovely downtown San Francisco.</p><p>The Call For Papers for PostgresOpen SV 2018 is open, but closing soon!</p><p>The PostgresOpen committee is especially excited to help support first time speakers or speakers from under-represented groups within technology. We strongly encourage those individuals to submit talks. As part of that effort we'll be providing mentoring for any speakers that desire it if your talk is accepted. Don't let prior experience speaking hold you back as we'd love to have you submit a talk.</p><p>If you are working with PostgreSQL, please go here and submit a talk!</p><a href=\"https://2018.postgresopen.org/callforpapers/\">https://2018.postgresopen.org/callforpapers/</a><p>The CFP closes on Tuesday, June 12.  We are looking for talks on all things PostgreSQL from Case Studies and experiences to New Features, Benchmarks, Existing Features, Data Science and Analysis, and everything in between.</p><p>Our Call For Sponsors is open!  We have many levels available for all companies to be able to sponsor, please review our prospectus and reach out to us about how you can sponsor.</p><a href=\"https://2018.postgresopen.org/becomesponsor/\">https://2018.postgresopen.org/becomesponsor/</a><p>The 2018 PostgresOpen SV Committee looks forward to bringing the best PostgreSQL presentations and tutorials from speakers around the world to San Francisco and to connect PostgreSQL users, DBAs, executives, developers, engineers, and our sponsors together!</p><p>PostgresOpen would not be possible without the support of our sponsors and we extend a special thanks to them:</p><ul><li>Citus Data</li><li>2nd Quadrant</li><li>EnterpriseDB</li></ul><p>Keep an eye on <a href=\"https://2018.postgresopen.org/sponsors/\">https://2018.postgresopen.org/sponsors/</a> for updates.<p>PostgresOpen is an Associated Project of the United States PostgreSQL Assocation (PgUS)!  Without PgUS, we would not be able to run these conferences each year, nor support the many PUGs around the country, so please visit <a href=\"https://postgresql.us\">https://postgresql.us</a> and consider becoming a member to help promote the growth and education of PostgreSQL in the US!</p><p>Speakers will be notified by June 19th, 2018, with the schedule to be published once selected speakers have confirmed.</p><p>Early Bird registration for PostgresOpen SV 2018 is now open and will be until July 18th.  You can register for the conference now by going to:</p><a href=\"https://2018.postgresopen.org/tickets/\">https://2018.postgresopen.org/tickets/</a><p>If you want to get a head start on reserving your room at the lovely Parc55 in downtown San Francsico you can book it at: <a href=\"https://aws.passkey.com/event/49526018/owner/1150/landing\">https://aws.passkey.com/event/49526018/owner/1150/landing</a><p>Join us in celebrating our 8th conference year!  We look forward to seeing everyone in San Francisco!</p>Any questions?  Please contact: program2018@postgresopen.org"
    },
    {
    "title": "PostgresOpen less than a month away",
    "sponsorname": "PostgresOpen",
    "posttime": "2018-08-14",
      "content":"<p>PostgresOpen is coming up in less than a month and we've got an exciting time planned. We're kicking off with tutorials on September 5th, followed by two days of talks ranging from talks by Postgres <a href=\"https://postgresql.us/events/pgopen2018/schedule/session/499-lessons-from-building-venicedb/\">end users</a> to <a href=\"https://postgresql.us/events/pgopen2018/schedule/session/574-just-in-time-compilation-in-postgresql/\">committers</a> talking about the latest and greatest <a href=\"https://postgresql.us/events/pgopen2018/schedule/session/548-parallelism-in-postgresql-11/\">performance advancements</a>. This year the conference is again held in downtown San Francisco, make it easy to get to your <a href=\"https://aws.passkey.com/event/49526018/owner/1150/landing\">hotel</a> via quick Bart ride from the airport without ever needing to grab a car.</p><p>Many of you are already registered for the conference and all set, but for you stragglers out there you still hvae some time to get your tickets and reserve your <a href=\"https://2018.postgresopen.org/venue/\">hotel room</a>. You'll want to make sure to grab you hotel room this week as the hotel block will run out by next week so make sure to secure your room so you can be right by all the <a href=\"https://postgresql.us/events/pgopen2018/schedule/\">conference activities</a>.</p> <p>You can get your room at the conference rate at: <a href=\"https://book.passkey.com/event/49526018/owner/1150/home\">https://book.passkey.com/event/49526018/owner/1150/home</a></p><p>If you're already set on your conference ticket and hotel room there is still one other think you may want to consider: The tutorials. On Wednesday we'll be hosting six tutorials to help you get some hands on deep dive experience with various Postgres topics. This year our tutorials include:</p><ul><li><b>In the AM</b><li><a href=\"https://postgresql.us/events/pgopen2018/schedule/speaker/52-keith-fiske/\">PostgreSQL Administration Training by Keith Fiske</a><li><a href=\"https://postgresql.us/events/pgopen2018/schedule/session/594-hands-on-with-azure-database-for-postgresql/\">Hands on with Azure Database for PostgreSQL by Teja Mupparti, Byju Sukumaran</a><li><a href=\"https://postgresql.us/events/pgopen2018/schedule/session/545-postgresql-application-development-with-nodejs/\">PostgreSQL Application Development With Node.js by Sehrope Sarkuni</a> <li><b>In the PM</b><li><a href=\"https://postgresql.us/events/pgopen2018/schedule/session/581-architecting-real-time-analytics-for-your-customers/\">Architecting real-time analytics for your customers by Marco Slot</a><li><a href=\"https://postgresql.us/events/pgopen2018/schedule/speaker/20-regina-obe-and-leo-hsu/\">The World of PostGIS by Regina Obe and Leo Hsu, Leo Hsu and Regina Obe</a><li><a href=\"https://postgresql.us/events/pgopen2018/schedule/session/487-lets-build-a-complex-real-time-data-management-applicationbefore-the-session-ends/\">Let's Build a Complex, Real-Time Data Management Application...before the session ends! by Jonathan S. Katz</a></ul><p><b>Note: You do need to register for tutorials in advance of the conference and cannot drop in day of, so please make sure to grab your registration now.</b></p><p>Have any questions or things we can help with as you prepare to join us at <a href=\"https://2018.postgresopen.org/\">PostgresOpen</a> this year? Email us at program2018@postgresopen.org. We look forward to seeing you all there.</p>"
    },
    {
    "title": "PostgresOpen Silicon Valley Registration Closing",
    "sponsorname": "PostgresOpen",
    "posttime": "2018-08-22",
      "content":"<p>We are down to counting the days until PostgresOpen SV 2018 in downtown San Francisco, September 5th to 7th! Registration is closing in coming days so make sure to grab your tickets while you still can. We also still  have a few seats in our tutorials open, so if you're hoping to attend a  half day tutorial/training save your seat today.</p><p>You can check out the schedule of tutorials and <a href=\"https://postgresql.us/events/schedule/pgopen2018/\">talks here</a></p><p>Then grab your <a href=\"https://2018.postgresopen.org/tickets/\">tickets</a><p>If you still need a room for the conference you can <a href=\"https://book.passkey.com/event/49526018/owner/1150/home\">reserve while available</a></p><p>Special thanks to our sponsors!  Be sure to check them out as we've just added on our second Diamond sponsor, and thanks to all of our other level sponsors as well.</p><p>This year we are pleased to be able to recognize our Diamond sponsors:</p><ul><li><a href=\"https://www.citusdata.com/\">CitusData</a></li><li><a href=\"https://azure.microsoft.com/en-us/services/postgresql/\">Microsoft</a></li></ul><p>Be sure to check out our site to see all of our Gold, Silver and Supporter sponsors, and our Community Partners <a href=\"https://2018.postgresopen.org/sponsors/\">here</a><p>PostgresOpen wouldn't be able to happen without the tireless efforts of the individuals at the [United States PostgreSQL Association <a href=\"https://postgresql.us\">(PgUS)</a>, please consider joining! PgUS is the non-profit organization which  backs PostgresOpen and other events.</p><p>We look forward to seeing everyone in San Francisco in of weeks!</p>"
    },
    {
    "title": "Announcing PostgresOpen Silicon Valley Guest Keynote: Brandon Philips",
    "sponsorname": "PostgresOpen",
    "posttime": "2018-08-23",
      "content":"<p>We're excited to announce <a href=\"https://twitter.com/BrandonPhilips\">Brandon Philips</a> the CTO from CoreOS will be joining us as our guest keynote for PostgresOpen Silicon Valley in a couple of weeks.</p><p>Brandon Philips was the CTO of CoreOS which was acquired by RedHat, where he is now part of the technical staff. CoreOS was instrumental in the early days of container orchestration and he'll join us to share a little of the journey in particular around etcd and it's evolution. </p><p>In July 2013 the etcd project was announced to solve a critical problem for CoreOS: how to safely coordinate unattended automatic software updates across a cluster of Linux nodes. Today hundreds of companies use etcd as part of their production systems to hold critical data for their Kubernetes clusters, network systems, monitoring systems, and much more.</p><p>But, how did etcd evolve from a CoreOS intern project to being a critical system in the Cloud Native ecosystem?</p><p>This talk will cover the 5 year history of etcd from the stumbles, use cases, and technical evolution. We will also dive into the trade-offs that were made as the system went from theoretical prototype to production ready workhorse. </p><p>You don't have to be an expert on containers, orchestration, or etcd to be able to have some great takeaways from this talk. </p><p>If you haven't already please make sure to <a href=\"https://2018.postgresopen.org/tickets/\">grab your ticket</a> so you'll be able to join us for enlightening talk before we're sold out.</p>"
    }    
	],

    "conference": "PostgresOpen 2018",

          "diamond": [
      	{
      	    "name": "Citus Data",
      	    "logo": "citusdata.png",
      	    "largelogo": "citusdata.png",
      	    "badgelogo": "citusdata.png",
      	    "link": "https://www.citusdata.com/",
      	    "intro": "Citus is worry-free Postgres for SaaS. Made to scale out, Citus is an extension to Postgres (not a fork) that distributes queries across any number of servers. Whether you have a multi-tenant app that needs scale, or you need to deliver real-time analytics to customers, with Citus you can focus on your app—not your database.<br><br>At Citus Data, we make it simple to shard PostgreSQL. Available as a fully-managed database as a service on AWS, as on-prem software, and as open source. Learn more at <a href=\"https://www.citusdata.com\">www.citusdata.com</a>."
      	},
        {
            "name": "Microsoft",
            "logo": "microsoft.png",
            "largelogo": "microsoft.png",
            "badgelogo": "microsoft_print.png",
            "link": "https://azure.microsoft.com/en-us/services/postgresql/",
            "intro": "Microsoft's mission is to empower every person and every organization on the planet to achieve more. With its Data & AI solutions, Microsoft enables developers to easily build and deliver intelligent apps by offering productive and familiar tools to integrate data and built-in AI. To offer more choice and flexibility to developers, Microsoft has now introduced Azure Database for PostgreSQL, a PaaS offering for PostgreSQL. Learn more at <a href=\"https://www.microsoft.com/PostgreSQL\">www.microsoft.com/PostgreSQL</a>."
        }
          ],

          "gold": [
        {
            "name": "2ndQuadrant",
            "logo": "2ndQ_logo.png",
            "largelogo": "2ndQ_logo.png",
            "badgelogo": "2ndQ_logo.png",
            "link": "https://www.2ndquadrant.com/",
            "intro": "2ndQuadrant is the team of diligent PostgreSQL experts. Their support engineers have over 100 years of combined code contributions to the PostgreSQL project, making them the only company to contribute enterprise features to all of the last 13 releases. 2ndQuadrant is the Gold Standard for PostgreSQL products & services."
        },
        {
          "name": "Enterprise DB",
          "logo": "edb_logo.png",
          "largelogo": "edb_logo.png",
          "badgelogo": "edb_logo.png",
          "link": "https://www.edbpostgres.com/",
          "intro": "EnterpriseDB® (EDB™), the database platform company for digital business, delivers the premier open source-based data platform for new applications, cloud re-platforming, application modernization, and legacy migration. EnterpriseDB integrates with enterprise technologies and infrastructures for hybrid cloud management, data integration, and data warehousing. Our customers benefit from the most reliable, high-performing, flexible, open, and cost-effective data management platform available. EnterpriseDB is based in Bedford, Massachusetts with offices around the globe. For more information, visit www.EDBPostgres.com."
        },
      	{
      	    "name": "Amazon Web Services",
      	    "logo": "AWS_logo_RGB-th2.jpg",
      	    "largelogo": "AWS_logo_RGB-th2.jpg",
      	    "badgelogo": "AWS_logo_RGB-th2.jpg",
      	    "link": "https://aws.amazon.com/",
      	    "intro": "Amazon Relational Database Service (Amazon RDS) makes it easy to set up, operate, and scale a relational database in the cloud. It provides cost-efficient and resizable capacity while automating time-consuming administration tasks such as hardware provisioning, database setup, patching and backups. It offers seven database engines to choose from, including <a href=\"https://aws.amazon.com/rds/postgresql/\">Amazon RDS for PostgreSQL</a> and <a href=\"https://aws.amazon.com/rds/aurora/\">Amazon Aurora PostgreSQL</a>, a PostgreSQL-compatible database that provides a compelling migration target for high-end commercial databases. Learn more at <a href=\"https://aws.amazon.com/rds/aurora/\">aws.amazon.com/rds/</a> and follow us at <a href=\"https://twitter.com/awscloud\">@AWSCloud</a>."
      	},
        {
            "name": "Braintree",
            "logo": "bt-logo-black-2dc4ba9a.png",
            "largelogo": "bt-logo-black-2dc4ba9a.png",
            "badgelogo": "bt-logo-black-2dc4ba9a.png",
            "link": "https://www.braintreepayments.com/",
            "intro": "Braintree, a PayPal service, provides the tools and expertise that make it easy for merchants to accept payments online and securely partner with others to seize next-generation commerce opportunities. Our global payments platform helps businesses of all sizes reach new customers and grow their revenue."
        },
        {
            "name": "Crunchy Data",
            "logo": "crunchy_data.png",
            "largelogo": "crunchy_data.png",
            "badgelogo": "crunchy_data.png",
            "link": "https://www.crunchydata.com/",
            "intro": "Crunchy Data is a leading provider of trusted open source PostgreSQL and enterprise PostgreSQL technology, support and training.  Crunchy Data offers Crunchy Certified PostgreSQL, the most advanced pure open source RDBMS on the market and the first open source RDBMS to achieve Common Criteria certification. Crunchy Data is a leading provider of Cloud Native PostgreSQL – providing open source, cloud agnostic PostgreSQL-as-a-Service solutions. PostgreSQL’s active development community, proven architecture and reputation for reliability, data integrity, and ease of use make it a prime candidate for enterprises looking for a robust relational database alternative to expensive proprietary database technologies."
        }
          ],

          "silver": [
      	{
      	    "logo": "1280px-Pivotal_Software_logo.svg.png",
      	    "largelogo": "1280px-Pivotal_Software_logo.svg.png",
      	    "badgelogo": "1280px-Pivotal_Software_logo.svg.png",
      	    "link": "https://pivotal.io/",
      	    "intro": " "
      	},
        {
            "logo": "ScaleGrid.png",
            "largelogo": "ScaleGrid.png",
            "badgelogo": "ScaleGrid.png",
            "link": "https://scalegrid.io/",
            "intro": " "
        }
          ],

          "supporter": [
      	{
      	    "logo": "jackdb-logomark-700x200.png",
      	    "largelogo": "jackdb-logomark-700x200.png",
      	    "badgelogo": "jackdb-logomark-700x200.png",
      	    "link": "https://www.jackdb.com/",
      	    "intro": " "
      	},
        {
            "logo": "zombodb.png",
            "largelogo": "zombodb.png",
            "badgelogo": "zombodb.png",
            "link": "https://www.zombodb.com/",
            "intro": " "
        },
        {
            "logo": "pgexperts.jpg",
            "largelogo": "pgexperts.jpg",
            "badgelogo": "pgexperts.jpg",
            "link": "https://pgexperts.com/",
            "intro": " "
        }
          ],
          "partner": [
            {
              "logo": "pgus.png",
              "largelogo": "pgus.png",
              "badgelogo": "pgus.png",
              "link": "https://postgresql.us/associatedprojects/",
              "intro": " "
            }
    ]

}
